PrmBRana/STM32WL55JC1_GMSK_CW_TEST_M0-_PC2_PA/Main_code/Main_Satellite/satellite_app.c
/*
 * ============================================================================
 * RF SWITCH SELECTION API
 * ============================================================================
 */

void Satellite_SetRFSwitch(RBI_Switch_TypeDef rf_switch) {
    RBI_ConfigRFSwitch(rf_switch);
}

RBI_Switch_TypeDef Satellite_GetRFSwitch(void) {
    return s_config.rfSwitchConfig;
}

/*
 * ============================================================================
 * CW / MORSE CODE BEACON ENGINE
 * ============================================================================
 */

static const char* Get_Morse_Code(char c) {
    switch (c) {
        case 'A': case 'a': return ".-";
        case 'B': case 'b': return "-...";
        case 'C': case 'c': return "-.-.";
        case 'D': case 'd': return "-..";
        case 'E': case 'e': return ".";
        case 'F': case 'f': return "..-.";
        case 'G': case 'g': return "--.";
        case 'H': case 'h': return "....";
        case 'I': case 'i': return "..";
        case 'J': case 'j': return ".---";
        case 'K': case 'k': return "-.-";
        case 'L': case 'l': return ".-..";
        case 'M': case 'm': return "--";
        case 'N': case 'n': return "-.";
        case 'O': case 'o': return "---";
        case 'P': case 'p': return ".--.";
        case 'Q': case 'q': return "--.-";
        case 'R': case 'r': return ".-.";
        case 'S': case 's': return "...";
        case 'T': case 't': return "-";
        case 'U': case 'u': return "..-";
        case 'V': case 'v': return "...-";
        case 'W': case 'w': return ".--";
        case 'X': case 'x': return "-..-";
        case 'Y': case 'y': return "-.--";
        case 'Z': case 'z': return "--..";
        case '0': return "-----";
        case '1': return ".----";
        case '2': return "..---";
        case '3': return "...--";
        case '4': return "....-";
        case '5': return ".....";
        case '6': return "-....";
        case '7': return "--...";
        case '8': return "---..";
        case '9': return "----.";
        case '.': return ".-.-.-";
        case ',': return "--..--";
        case '?': return "..--..";
        case '/': return "-..-.";
        case '-': return "-....-";
        default:  return NULL;
    }
}

void Satellite_CW_Prepare(void) {
    int8_t power = (s_config.txPowerDbm != 0) ? s_config.txPowerDbm : RADIO_TX_POWER_DBM;
    if (s_config.rfSwitchConfig != RBI_SWITCH_RFO_HP && power > 14) power = 14;
    if (power > 22) power = 22;
    uint8_t pa_sel = (s_config.rfSwitchConfig == RBI_SWITCH_RFO_HP) ? RFO_HP : RFO_LP;
    Radio.Standby();

    /* Ensure 5V DC/DC (PA0) and 5V PA (PC3) are completely OFF for CW mode */
    uart1_puts(">>> CW PREPARE: 5V DC/DC & 5V PA OFF, 3.3V PA ON (PC2/SO2)\r\n");
    RBI_Enable5VDCDC(0);
    HAL_GPIO_WritePin(GPIOC, AMP_5V_EN_PIN, GPIO_PIN_RESET);

    /* Explicitly configure 3.3V PA (PC2/SO2) for CW mode (3.3V rail is hardware always-on) */
    RBI_SetTxSwitchConfig(s_config.rfSwitchConfig);
    Satellite_SetRFSwitch(s_config.rfSwitchConfig);
    CPU2_Delay_Ms(2); /* Settle delay for 3.3V PA */

    SUBGRF_SetStandby(STDBY_RC);
    SUBGRF_SetDioIrqParams(IRQ_RADIO_NONE, IRQ_RADIO_NONE, IRQ_RADIO_NONE, IRQ_RADIO_NONE);
    SUBGRF_ClearIrqStatus(IRQ_RADIO_ALL);
    SUBGRF_SetPacketType(PACKET_TYPE_GFSK);
    SUBGRF_SetRfFrequency(s_config.radio.txFrequency);
    SUBGRF_SetTxParams(pa_sel, power, RADIO_RAMP_40_US);
    SUBGRF_WriteRegister(REG_DRV_CTRL, 0x7 << 1);
    SUBGRF_SetSwitch(pa_sel, RFSWITCH_TX);
}

void Satellite_CW_CarrierOn(void) {
    SUBGRF_SetTxContinuousWave();
}

void Satellite_CW_CarrierOff(void) {
    /* Return to STDBY_XOSC: cuts RF carrier immediately while keeping 32MHz TCXO running */
    SUBGRF_SetStandby(STDBY_XOSC);
}

void Satellite_CW_Finish(void) {
    SUBGRF_SetStandby(STDBY_RC);
    Radio.Standby();
    /* Power down 3.3V External PA, 5V DC/DC, and RF switch after CW session completes */
    Satellite_SetRFSwitch(RBI_SWITCH_OFF);
    SUBGRF_SetDioIrqParams(IRQ_RADIO_NONE, IRQ_RADIO_NONE, IRQ_RADIO_NONE, IRQ_RADIO_NONE);
    SUBGRF_ClearIrqStatus(IRQ_RADIO_ALL);
    tx_busy = 0;
}

void Satellite_Hold_Continuous_Carrier(uint32_t seconds) {
    uart1_puts("\r\n============================================================\r\n");
    uart1_printf(">>> STARTING CONTINUOUS CARRIER HOLD (%lu SECONDS) <<<\r\n", (unsigned long)seconds);
    uart1_printf(" Frequency : %lu.%03lu MHz\r\n",
                 (unsigned long)(s_config.radio.txFrequency / 1000000UL),
                 (unsigned long)((s_config.radio.txFrequency % 1000000UL) / 1000UL));
    uart1_printf(" Power     : +%d dBm (RFO_%s)\r\n",
                 (s_config.txPowerDbm != 0) ? s_config.txPowerDbm : RADIO_TX_POWER_DBM,
                 (s_config.rfSwitchConfig == RBI_SWITCH_RFO_HP) ? "HP" : "LP");
    uart1_puts(" Ideal for spectrum analyzer / oscilloscope RF power probing\r\n");
    uart1_puts("============================================================\r\n");

    Satellite_CW_Prepare();
    Satellite_CW_CarrierOn();

    uint32_t start_ms = Get_Time_Ms();
    uint32_t duration_ms = seconds * 1000;
    while ((Get_Time_Ms() - start_ms) < duration_ms) {
        uint32_t elapsed_s = (Get_Time_Ms() - start_ms) / 1000;
        uart1_printf(" [CARRIER ACTIVE] Elapsed: %lu s / %lu s\r\n",
                     (unsigned long)elapsed_s, (unsigned long)seconds);
        CPU2_Delay_Ms(1000);
    }

    Satellite_CW_CarrierOff();
    Satellite_CW_Finish();
    uart1_puts(">>> CONTINUOUS CARRIER HOLD COMPLETE <<<\r\n\r\n");
}

void Satellite_Hold_Continuous_Carrier_5V(uint32_t seconds) {
    uart1_puts("\r\n============================================================\r\n");
    uart1_printf(">>> STARTING 5V PA CONTINUOUS CARRIER HOLD (%lu SECONDS) <<<\r\n", (unsigned long)seconds);
    uart1_printf(" Frequency : %lu.%03lu MHz\r\n",
                 (unsigned long)(s_config.radio.txFrequency / 1000000UL),
                 (unsigned long)((s_config.radio.txFrequency % 1000000UL) / 1000UL));
    uart1_printf(" Power     : +%d dBm (5V External PA PC3 / SI2, Boost PA0 ON)\r\n",
                 (s_config.txPowerDbm != 0) ? s_config.txPowerDbm : RADIO_TX_POWER_DBM);
    uart1_puts(" Pure unmodulated CW carrier for Spectrum Analyzer / Power Meter\r\n");
    uart1_puts(" Eliminates GMSK modulation spreading to verify true 27 dBm saturation\r\n");
    uart1_puts("============================================================\r\n");

    int8_t power = (s_config.txPowerDbm != 0) ? s_config.txPowerDbm : RADIO_TX_POWER_DBM;
    uint8_t pa_sel = (s_config.rfSwitchConfig == RBI_SWITCH_RFO_HP) ? RFO_HP : RFO_LP;
    Radio.Standby();

    /* 1. Ensure 3.3V External PA (PC2) is OFF */
    HAL_GPIO_WritePin(GPIOC, AMP_3V3_EN_PIN, GPIO_PIN_RESET);

    /* 2. Enable 5V DC/DC Converter (PA0 = 1) */
    RBI_Enable5VDCDC(1);
    CPU2_Delay_Ms(10); /* 10 ms soft-start settle delay for 5V boost capacitor charging */

    /* 3. Configure RF switch and assert 5V External PA (PC3 = 1) */
    RBI_SetTxSwitchConfig(s_config.rfSwitchConfig5V);
    Satellite_SetRFSwitch(s_config.rfSwitchConfig5V);
    CPU2_Delay_Ms(2);  /* 2 ms PA bias settle delay */

    SUBGRF_SetStandby(STDBY_RC);
    SUBGRF_SetDioIrqParams(IRQ_RADIO_NONE, IRQ_RADIO_NONE, IRQ_RADIO_NONE, IRQ_RADIO_NONE);
    SUBGRF_ClearIrqStatus(IRQ_RADIO_ALL);
    SUBGRF_SetPacketType(PACKET_TYPE_GFSK);
    SUBGRF_SetRfFrequency(s_config.radio.txFrequency);
    SUBGRF_SetTxParams(pa_sel, power, RADIO_RAMP_40_US);
    SUBGRF_WriteRegister(REG_DRV_CTRL, 0x7 << 1);
    SUBGRF_SetSwitch(pa_sel, RFSWITCH_TX);

    /* Turn on pure continuous carrier */
    SUBGRF_SetTxContinuousWave();

    uint32_t start_ms = Get_Time_Ms();
    uint32_t duration_ms = seconds * 1000;
    while ((Get_Time_Ms() - start_ms) < duration_ms) {
        uint32_t elapsed_s = (Get_Time_Ms() - start_ms) / 1000;
        uart1_printf(" [5V CARRIER ACTIVE] Elapsed: %lu s / %lu s\r\n",
                     (unsigned long)elapsed_s, (unsigned long)seconds);
        CPU2_Delay_Ms(1000);
    }

    /* Cut carrier and put radio in standby */
    SUBGRF_SetStandby(STDBY_RC);
    Radio.Standby();

    /* Power down 5V PA PC3, 5V DC/DC PA0, and RF switch */
    Satellite_SetRFSwitch(RBI_SWITCH_OFF);
    SUBGRF_SetDioIrqParams(IRQ_RADIO_NONE, IRQ_RADIO_NONE, IRQ_RADIO_NONE, IRQ_RADIO_NONE);
    SUBGRF_ClearIrqStatus(IRQ_RADIO_ALL);

    uart1_puts(">>> 5V CONTINUOUS CARRIER HOLD COMPLETE <<<\r\n\r\n");
}

void Satellite_CW_SendChar(char c, uint32_t unit_ms) {
    if (c == ' ') {
        CPU2_Delay_Ms(unit_ms * 4);
        return;
    }

