PrmBRana/STM32WL55JC1_GMSK_CW_TEST_M0-_PC2_PA/Main_code/Main_Satellite/satellite_app.c
/*
 * ============================================================================
 * CW BEACON EXECUTION
 * ============================================================================
 */

void Satellite_Run_CW_Session_Ex(uint32_t cycle,
                                 const char *callsign,
                                 const char *msg,
                                 uint32_t unit_ms,
                                 uint32_t duration_ms,
                                 uint32_t carrier_tone_ms,
                                 uint32_t carrier_post_delay_ms,
                                 uint32_t inter_str_delay_ms,
                                 uint32_t repeat_delay_ms) {
    if (!callsign) callsign = "9NS2S2NEPAL";
    if (!msg) msg = "Namaste everyone, Testing GMSK signal ";
    if (unit_ms == 0) unit_ms = 80;
    if (duration_ms == 0) duration_ms = 60000;

    int8_t power = (s_config.txPowerDbm != 0) ? s_config.txPowerDbm : RADIO_TX_POWER_DBM;

    uart1_puts("\r\n============================================================\r\n");
    uart1_printf(">>> [CYCLE #%lu: STARTING CW MORSE SESSION] <<<\r\n", (unsigned long)cycle);
    uart1_printf(" Downlink Frequency : %lu.%03lu MHz | Power: +%d dBm\r\n",
                 (unsigned long)(s_config.radio.txFrequency / 1000000UL),
                 (unsigned long)((s_config.radio.txFrequency % 1000000UL) / 1000UL),
                 power);
    uart1_printf(" RF Switch          : %s (3.3V External PA PC2 / SO2)\r\n",
                 (s_config.rfSwitchConfig == RBI_SWITCH_RFO_HP) ? "RBI_SWITCH_RFO_HP" : "RBI_SWITCH_RFO_LP");
    uart1_puts(" 5V DC/DC (PA0)     : OFF\r\n");
    uart1_puts(" Modulation         : Continuous Wave (CW / Carrier Keying)\r\n");
    uart1_printf(" Morse Unit         : %lu ms\r\n", (unsigned long)unit_ms);
    uart1_printf(" Session Duration   : %lu Seconds\r\n", (unsigned long)(duration_ms / 1000));
    uart1_puts("============================================================\r\n");

    Satellite_CW_Prepare();
    uint32_t cw_start_time = Get_Time_Ms();

    /* Optional pre-beacon tuning carrier tone */
    if (carrier_tone_ms > 0) {
        uart1_printf("[CW] Emitting %lu ms continuous carrier tone...\r\n", (unsigned long)carrier_tone_ms);
        Satellite_CW_CarrierOn();
        CPU2_Delay_Ms(carrier_tone_ms);
        Satellite_CW_CarrierOff();
        if (carrier_post_delay_ms > 0) {
            CPU2_Delay_Ms(carrier_post_delay_ms);
        }
    }

    uint32_t morse_iter = 0;
    while ((Get_Time_Ms() - cw_start_time) < duration_ms) {
        morse_iter++;
        uint32_t elapsed_s = (Get_Time_Ms() - cw_start_time) / 1000;
        uart1_printf("[CW #%lu] Keying \"%s\" (Elapsed: %lu s / %lu s)\r\n",
                     (unsigned long)morse_iter, callsign, (unsigned long)elapsed_s, (unsigned long)(duration_ms / 1000));

        Satellite_CW_SendString(callsign, unit_ms);

        if (inter_str_delay_ms > 0) {
            CPU2_Delay_Ms(inter_str_delay_ms);
        }
        if ((Get_Time_Ms() - cw_start_time) >= duration_ms) break;

        uart1_printf("[CW] Keying \"%s\"\r\n", msg);
        Satellite_CW_SendString(msg, unit_ms);

        if (repeat_delay_ms > 0) {
            CPU2_Delay_Ms(repeat_delay_ms);
        }
    }

    Satellite_CW_Finish();

    uart1_printf(">>> CW TRANSMISSION COMPLETE (Cycle #%lu, %lu beacon iterations) <<<\r\n",
                 (unsigned long)cycle, (unsigned long)morse_iter);
    uart1_puts("------------------------------------------------------------\r\n\r\n");
}

void Satellite_Run_CW_Session(uint32_t cycle) {
    Satellite_Run_CW_Session_Ex(cycle,
                                s_config.cwBeaconCallsign,
                                s_config.cwBeaconMessage,
                                s_config.morseUnitMs,
                                s_config.cwDurationMs,
                                s_config.cwTuningCarrierDurationMs,
                                s_config.cwTuningPostDelayMs,
                                s_config.cwInterStringDelayMs,
                                s_config.cwRepeatIntervalMs);
}

/*
 * ============================================================================
 * GMSK PACKET & BURST TRANSMISSION
 * ============================================================================
 */

void Satellite_GMSK_Prepare(void) {
    int8_t power = (s_config.txPowerDbm != 0) ? s_config.txPowerDbm : RADIO_TX_POWER_DBM;
    uint8_t pa_sel = (s_config.rfSwitchConfig == RBI_SWITCH_RFO_HP) ? RFO_HP : RFO_LP;
    Radio.Standby();

    if (s_config.rfSwitchConfig5V == RBI_SWITCH_RFO_LP5V) {
        /*
         * 5V External PA Mode (Flight Mode):
         * 1. Ensure 3.3V External PA (PC2) is completely OFF
         * 2. Enable 5V DC/DC Converter (PA0 = 1)
         * 3. Settle delay: 50 ms soft-start for 5V boost capacitors to reach steady state,
         *    preventing input rail collapse / BOR reset on cold boots.
         * 4. Configure RF switch (PC4=0, PC5=1) and assert 5V External PA (PC3 = 1)
         * 5. Settle delay: 15 ms for PA DC bias stabilization before RF transmission.
         */
        HAL_GPIO_WritePin(GPIOC, AMP_3V3_EN_PIN, GPIO_PIN_RESET);
        RBI_Enable5VDCDC(1);
        CPU2_Delay_Ms(50); /* 50 ms robust capacitor soft-start settle delay */

        RBI_SetTxSwitchConfig(RBI_SWITCH_RFO_LP5V);
        Satellite_SetRFSwitch(RBI_SWITCH_RFO_LP5V);
        CPU2_Delay_Ms(15); /* 15 ms PA bias settle delay */
    } else {
        /*
         * 3.3V External PA Mode (Safe Bench / ST-Link USB Mode):
         * 1. Ensure 5V DC/DC (PA0) and 5V PA (PC3) are OFF
         * 2. Enable 3.3V External PA (PC2 = 1)
         * 3. Current draw remains <170 mA - zero brownout risk under any USB supply!
         */
        RBI_Enable5VDCDC(0);
        HAL_GPIO_WritePin(GPIOC, AMP_5V_EN_PIN, GPIO_PIN_RESET);

        RBI_SetTxSwitchConfig(s_config.rfSwitchConfig);
        Satellite_SetRFSwitch(s_config.rfSwitchConfig);
        CPU2_Delay_Ms(5);  /* 5 ms PA settle delay */
    }

    SUBGRF_SetStandby(STDBY_RC);
    SUBGRF_SetPacketType(PACKET_TYPE_GFSK);
    RadioApp_SetTxPower(power);
    RadioApp_SetPaSelect(pa_sel);
    RadioApp_ForceOpenGfskParams();
}

