PrmBRana/STM32WL55JC1_GMSK_CW_TEST_M0-_PC2_PA/Main_code/Main_Satellite/satellite_app.c
bool Satellite_Send_Packet_Timeout(const uint8_t *payload, uint16_t len, uint32_t timeout_ms) {
    if (!payload || len == 0) return false;
    if (timeout_ms == 0) timeout_ms = (s_config.txTimeoutMs > 0) ? s_config.txTimeoutMs : 3000;

    /* First enable 5V DC/DC (PA0) and 5V PA (PC3/SI2) before GMSK transmission */
    Satellite_GMSK_Prepare();

    uint16_t frame_size = Protocol_CreatePacket(s_burst_scrambled, payload, len, &s_config.radio);
    if (frame_size == 0) {
        uart1_puts("ERROR: Failed to assemble packet!\r\n");
        Satellite_SetRFSwitch(RBI_SWITCH_OFF);
        return false;
    }

    bool res = Radio_Send_And_Wait(s_burst_scrambled, frame_size, timeout_ms);
    CPU2_Delay_Ms(2); /* Settle guard delay for PA ramp-down before shutting down RF switch & external PA */
    /* Only on while GMSK send PA0, otherwise OFF */
    Satellite_SetRFSwitch(RBI_SWITCH_OFF);
    return res;
}

bool Satellite_Send_Packet(const uint8_t *payload, uint16_t len) {
    return Satellite_Send_Packet_Timeout(payload, len, s_config.txTimeoutMs);
}

bool Satellite_Send_AX25_String_Timeout(const char *text, uint32_t timeout_ms) {
    if (!text) return false;
    return Satellite_Send_Packet_Timeout((const uint8_t *)text, (uint16_t)strlen(text), timeout_ms);
}

bool Satellite_Send_AX25_String(const char *text) {
    return Satellite_Send_AX25_String_Timeout(text, s_config.txTimeoutMs);
}

void Satellite_Run_GMSK_Burst_Session_Ex(uint32_t cycle,
                                        const char *payload_text,
                                        uint32_t duration_ms,
                                        uint32_t interval_ms,
                                        uint32_t timeout_ms) {
    char safe_base_text[64];
    if (payload_text != NULL && payload_text[0] >= 0x20 && (uint8_t)payload_text[0] < 0x7F) {
        strncpy(safe_base_text, payload_text, sizeof(safe_base_text) - 1);
        safe_base_text[sizeof(safe_base_text) - 1] = '\0';
    } else {
        strncpy(safe_base_text, SAT_CFG_DEFAULT_GMSK_PAYLOAD, sizeof(safe_base_text) - 1);
        safe_base_text[sizeof(safe_base_text) - 1] = '\0';
    }

    if (duration_ms == 0) duration_ms = 60000;
    if (interval_ms == 0) interval_ms = 300;
    if (timeout_ms == 0) timeout_ms = (s_config.txTimeoutMs > 0) ? s_config.txTimeoutMs : 3000;

    int8_t power = (s_config.txPowerDbm != 0) ? s_config.txPowerDbm : RADIO_TX_POWER_DBM;
    uint32_t bitrate = (s_config.bitrateBps > 0) ? s_config.bitrateBps : RADIO_BIT_RATE_BPS;

    uart1_puts("============================================================\r\n");
    uart1_printf(">>> [CYCLE #%lu: STARTING GMSK BURST SESSION] <<<\r\n", (unsigned long)cycle);
    uart1_printf(" Downlink Frequency : %lu.%03lu MHz | Power: +%d dBm\r\n",
                 (unsigned long)(s_config.radio.txFrequency / 1000000UL),
                 (unsigned long)((s_config.radio.txFrequency % 1000000UL) / 1000UL),
                 power);
    if (s_config.rfSwitchConfig5V == RBI_SWITCH_RFO_LP5V) {
        uart1_printf(" RF Switch          : %s (5V External PA PC3 / SI2)\r\n", "RBI_SWITCH_RFO_LP5V");
        uart1_puts(" 5V DC/DC (PA0)     : ENABLED (Powering 5V External PA)\r\n");
    } else {
        uart1_printf(" RF Switch          : %s (3.3V External PA PC2 / SO2)\r\n", "RBI_SWITCH_RFO_LP");
        uart1_puts(" 5V DC/DC (PA0)     : OFF (Safe Bench Mode)\r\n");
    }
    uart1_puts(" Protocol           : AX.25 UI Frame + G3RUH Scrambler\r\n");
    uart1_printf(" Bitrate            : %lu bps GMSK\r\n", (unsigned long)bitrate);
    uart1_printf(" Session Duration   : %lu Seconds continuous burst\r\n", (unsigned long)(duration_ms / 1000));
    uart1_printf(" Inter-Packet Delay : %lu ms | TX Timeout: %lu ms\r\n", (unsigned long)interval_ms, (unsigned long)timeout_ms);
    uart1_printf(" Destination        : %s-%d | Source: %s-%d\r\n",
                 s_config.radio.destCallsign, s_config.radio.destSSID,
                 s_config.radio.sourceCallsign, s_config.radio.sourceSSID);
    uart1_puts("============================================================\r\n");

    /* First enable 5V DC/DC (PA0) and 5V PA (PC3) before GMSK burst session starts */
    Satellite_GMSK_Prepare();

    uint16_t raw_len = 0;

    /* Assemble raw frame template for verification display */
    char template_payload[96];
    snprintf(template_payload, sizeof(template_payload), "%s #%lu", safe_base_text, (unsigned long)(s_total_packets_sent + 1));
    AX25_BuildFrame(s_raw_frame, sizeof(s_raw_frame), &raw_len,
                    s_config.radio.destCallsign, s_config.radio.destSSID,
                    s_config.radio.sourceCallsign, s_config.radio.sourceSSID,
                    (const uint8_t *)template_payload, (uint16_t)strlen(template_payload));

    if (raw_len > 0) {
        Print_AX25_Fields("GMSK BURST AX.25 PACKET TEMPLATE", s_raw_frame, raw_len);
    }

    /* Pre-burst unmodulated 5V tuning carrier tone for spectrum analyzer power calibration */
    if (s_config.gmskTuningCarrierDurationMs > 0) {
        uart1_printf("[GMSK] Emitting %lu ms 5V tuning carrier tone for power calibration...\r\n",
                     (unsigned long)s_config.gmskTuningCarrierDurationMs);
        SUBGRF_SetTxContinuousWave();
        CPU2_Delay_Ms(s_config.gmskTuningCarrierDurationMs);
        SUBGRF_SetStandby(STDBY_RC);
        if (s_config.gmskTuningPostDelayMs > 0) {
            CPU2_Delay_Ms(s_config.gmskTuningPostDelayMs);
        }
    }

    uart1_printf("[GMSK] Starting burst session (%lu s, interval: %lu ms)...\r\n",
                 (unsigned long)(duration_ms / 1000), (unsigned long)interval_ms);

    uint32_t burst_start_time = Get_Time_Ms();
    uint32_t sent_ok = 0;
    uint32_t sent_timeout = 0;
    uint32_t pkt_num = 0;

    while (1) {
        uint32_t cur_time = Get_Time_Ms();
        uint32_t elapsed_ms = (cur_time >= burst_start_time) ? (cur_time - burst_start_time) : 0;
        if (elapsed_ms >= duration_ms) {
            break;
        }

