PrmBRana/STM32WL55JC1_GMSK_CW_TEST_M0-_PC2_PA/Main_code/Main_Satellite/satellite_app.c
        pkt_num++;
        s_total_packets_sent++;

        /* Dynamically format payload with increasing packet counter */
        char dynamic_payload[96];
        snprintf(dynamic_payload, sizeof(dynamic_payload), "%s #%lu",
                 safe_base_text, (unsigned long)s_total_packets_sent);

        uint16_t frame_size = Protocol_CreatePacket(s_burst_scrambled,
                                                    (const uint8_t *)dynamic_payload,
                                                    (uint16_t)strlen(dynamic_payload),
                                                    &s_config.radio);
        if (frame_size == 0) {
            uart1_puts("ERROR: Failed to assemble AX.25 frame!\r\n");
            continue;
        }

        bool ok = Radio_Send_And_Wait(s_burst_scrambled, frame_size, timeout_ms);
        if (ok) sent_ok++; else sent_timeout++;

        cur_time = Get_Time_Ms();
        elapsed_ms = (cur_time >= burst_start_time) ? (cur_time - burst_start_time) : 0;
        uint32_t elapsed_s = elapsed_ms / 1000;
        uart1_printf(" [GMSK TX #%lu (Total: %lu)] %s | \"%s\" (Elapsed: %lu s / %lu s)\r\n",
                     (unsigned long)pkt_num, (unsigned long)s_total_packets_sent,
                     ok ? "sent OK" : "TIMEOUT", dynamic_payload,
                     (unsigned long)elapsed_s, (unsigned long)(duration_ms / 1000));

        CPU2_Delay_Ms(interval_ms);
    }

    /* Guard delay: allow final packet PA ramp-down to finish cleanly before RF switch off */
    CPU2_Delay_Ms(2);
    Radio.Standby();
    /* Only on while GMSK send PA0, otherwise OFF: Power down 5V PA PC3, 5V DC/DC PA0, and RF switch */
    Satellite_SetRFSwitch(RBI_SWITCH_OFF);
    SUBGRF_SetDioIrqParams(IRQ_RADIO_NONE, IRQ_RADIO_NONE, IRQ_RADIO_NONE, IRQ_RADIO_NONE);
    SUBGRF_ClearIrqStatus(IRQ_RADIO_ALL);
    tx_busy = 0;

    uart1_printf(">>> GMSK BURST COMPLETE: %lu sent OK, %lu timeouts (Total Packets: %lu) <<<\r\n",
                 (unsigned long)sent_ok, (unsigned long)sent_timeout, (unsigned long)s_total_packets_sent);
    uart1_puts("============================================================\r\n\r\n");
}

void Satellite_Run_GMSK_Burst_Session(uint32_t cycle) {
    Satellite_Run_GMSK_Burst_Session_Ex(cycle,
                                       s_config.gmskPayloadText,
                                       s_config.gmskDurationMs,
                                       s_config.gmskPacketIntervalMs,
                                       s_config.txTimeoutMs);
}

void Satellite_Run_Cycle_Ex(uint32_t cycle, uint32_t guard_delay_ms) {
    if (guard_delay_ms == 0) {
        guard_delay_ms = (s_config.cycleGuardDelayMs > 0) ? s_config.cycleGuardDelayMs : 1000;
    }

    /* 1. Continuous CW Morse Beacon Session */
    Satellite_Run_CW_Session(cycle);

    /* Guard interval between CW and Burst sent from parameter */
    CPU2_Delay_Ms(guard_delay_ms);

    /* 2. Continuous GMSK Burst Data Stream */
    Satellite_Run_GMSK_Burst_Session(cycle);

    /* Guard interval between Burst and next CW sent from parameter */
    CPU2_Delay_Ms(guard_delay_ms);
}

void Satellite_Run_Cycle(uint32_t cycle) {
    Satellite_Run_Cycle_Ex(cycle, s_config.cycleGuardDelayMs);
}

void Satellite_Run(void) {
    uint32_t cycle = 0;
    while (1) {
        cycle++;
        Satellite_Run_Cycle(cycle);
    }
}
